[
    {
        "id": 1,
        "name": "Solar Roof",
        "mainDescription": "El Solar Roof es el único techo que puede ayudar a pagarse solo con la energía que produce. Alimente su hogar con energía solar y tome el control de su recibo mensual de electricidad.Con un diseño perfecto, cada teja se ve muy bien de cerca o desde la calle, y complementa el estilo estético natural de su casa.",
        "secondaryDescription": "Se paga solo con el tiempo, ademas de reducir el impacto negativo en nuestro plante. --Potencia de carga max 50A, 2200 w 220v-- ",
        "image": "solar01.jpg",
        "category": "accesory",
        "status": "visited",
        "price": 60000,
        "discount": 15
    },
    {
        "id": 2,
        "name": "Android Bot",
        "mainDescription": "Android Bot tendrá una altura de 1,72 metros y un peso cercano a 57 kilos, y se espera que sea capaz de transportar cargas de hasta 20 kilos, e incluso levantar hasta 68 kilos en peso muerto. Su velocidad máxima para andar será de 8 kilómetros por hora.",
        "secondaryDescription": "Tesla Bot, que tendrá manos con cinco dedos y vendrá en blanco y negro será amistoso y construido de tal manera que en todo caso puedas huir de él y apagarlo",
        "image": "robotics-1.jfif",
        "category": "accesory",
        "status": "visited",
        "price": 90000,
        "discount": 10
    },
    {
        "id": 3,
        "name": "Mini-Dron PG2021 HQ",
        "mainDescription": "El pequeño dron integra una cámara provista de un sensor de 1/2,3 pulgadas capaz de capturar vídeos a 2,7K a 30 frames por segundo y 1.080p a 60 fps y fotografías a 12 megapíxeles, que sin llegar a 4K no queda tampoco lejos de lo que son capaces de hacer algunos drones de primera línea. Integra un estabilizador motorizado de tres ejes buscando que los vídeos sean fluidos a la par de estable",
        "secondaryDescription": "Aciende en vertical mientras encuadra el objetivo con la cámara apuntando hacia abajo. Puede fija un limite de altura de 40 a 120 pies",
        "image": "mini-dron-2.webp",
        "category": "accesory",
        "status": "in-sale",
        "price": 60000,
        "discount": 30
    },
    {
        "id": 4,
        "name": "Home Charger",
        "mainDescription": "El Wall Connector es un accesorio de carga universal para autos Electricos, que se instala de forma permanente en una pared o un poste. Instale la unidad en un interruptor de 60 Amps. Esto permite usar la capacidad total de carga. Sin embargo, el Wall Connector se puede personalizar para casi cualquier fuente de alimentación, incluyendo situaciones de baja potencia hasta 15 A.",
        "secondaryDescription": "El mejor lugar para cargar tu Tesla es en casa, por la noche. Solo tiene que conectarlo cuando llegue a tu casa y despertará con una carga completa cada mañana",
        "image": "wall-conector-3.jpg",
        "category": "accesory",
        "status": "in-sale",
        "price": 75000,
        "discount": 30
    },
    {
        "id": 5,
        "name": "Modelo S",
        "mainDescription": "El Model S está construido desde cero como un vehículo eléctrico, con una arquitectura de alta resistencia y un paquete de baterías colocado en el piso para una increíble protección de los ocupantes y un bajo riesgo de volcadura.Cada Model S incluye las últimas actualizaciones de seguridad activa de Tesla, como el Frenado automático de emergencia, sin costo adicional.",
        "secondaryDescription": "Las plataformas del Model S unen las tecnologías de sistema de propulsión y batería para un performance, autonomía y eficiencia inigualables-Potencia maxima: 1,020 hp 0 a 100 km/h: 2.1s 250 km/h 1/4 milla - ",
        "image": "modelsplaid-1.jfif",
        "category": "electric-car",
        "status": "visited",
        "price": 1400000,
        "discount": 15
    },
    {
        "id": 6,
        "name": "CyberTruck",
        "mainDescription": "Cybertruck está fabricado con un revestimiento exterior hecho para máxima durabilidad y protección de los pasajeros. Comenzando con un exoesqueleto casi impenetrable, todos los componentes están diseñados para proporcionar resistencia y firmeza superiores, desde la capa estructural de acero inoxidable laminado en frío ultraduro de 30X hasta el cristal blindado Tesla. Con una capacidad de carga de hasta 1588 kg y una suspensión neumática ajustable.",
        "secondaryDescription": "Velocidad y versatilidad, solo posible con un diseño totalmente eléctrico. --Potencia maxima: 1,020 hp 0 a 100 km/h: 2.1s 250 km/h 1/4 milla-- lo que permite que la aceleración vaya de 0 a 60 mph en tan solo 2.9 segundos y hasta 500 millas de autonomía. ",
        "image": "Cybertruck_01.jfif",
        "category": "electric-car",
        "status": "in-sale",
        "price": 2100000,
        "discount": 25
    },
    {
        "id": 7,
        "name": "Modelo 3",
        "mainDescription": "El Model 3 ofrece la opción de motor dual con tracción integral, ruedas Überturbine de 20, frenos de gran desempeño y suspensión más baja para mayor control total en todas las condiciones climáticas. Adicionalmente, un alerón de fibra de carbono mejora la estabilidad en altas velocidades, lo que permite que el Model 3 acelere de 0 a 100 km/h* en tan solo 3.3 segundos.",
        "secondaryDescription": "La tracción en todas las ruedas del Motor dual controla instantáneamente la tracción y el torque en todas las condiciones climáticas--Potencia maxima: 995 hp 0 a 100 km/h: 3.3s 261 km/h 1/4 milla--",
        "image": "Model3_26.jfif",
        "category": "electric-car",
        "status": "visited",
        "price": 1600000,
        "discount": 10
    },
    {
        "id": 8,
        "name": "Roadster",
        "mainDescription": "El Tesla Roadster es un deportivo con una relación entre potencia y peso suficiente para ser el mas rapido del mundo. Su transmisión de potencia entre baterías y motores eléctricos muy superior a la que nunca antes visto en un coche eléctrico",
        "secondaryDescription": " Cuenta con una capacidad de almacenamiento en baterías de 200 kWh. Eso es el doble de la capacidad que puede acumular un Tesla Model S, o un Tesla Model X,--Velocidad máxima 400 km/h Aceleración de 0 a 100 km/h en 2,1 segundos, todo con una autonomía eléctrica de 1000 kilómetros--",
        "image": "Roadster_01.jfif",
        "category": "electric-car",
        "status": "in-sale",
        "price": 1700000,
        "discount": 25
    }
]
   
